src/ПодсистемаPAPI/InformationRegisters/PAPI_ОчередьДействийСДокументами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>PAPI_ОчередьДействийСДокументами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.PAPI_ДействиеСДокументом</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/ПодсистемаPAPI/Enums/PAPI_ТипЛога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>PAPI_ТипЛога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Примечание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ПодсистемаPAPI/Enums/PAPI_ДействиеСДокументом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>PAPI_ДействиеСДокументом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОтменаПроведения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проведение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведениеНеоперативный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запись</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/ПодсистемаPAPI/InformationRegisters/PAPI_ОчередьДействийСДокументами/Ext/ManagerModule.bsl
// Функция - Добавить изменить запись
//
// Параметры:
//  СтруктураЗаписи	 - Структура - Необходимая структура для записи в регистр
// 
// Возвращаемое значение:
//  Булево - Истина -запись прошла без ошибок, Ложь - были ошибки при записи
//
Функция ДобавитьИзменитьЗапись(СтруктураЗаписи) Экспорт   
	
	Результат = Ложь;
	
	ВключенПривилегированныйРежим = Ложь;
	Если Не ПривилегированныйРежим() Тогда  
		ВключенПривилегированныйРежим = Истина;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);
	КонецЕсли;	
	
	
	Если ТипЗнч(СтруктураЗаписи) <> Тип("Структура") Тогда
		
		ТекстОшибки = НСтр("ru = 'Запись не является Структурой'; en = 'Record is not a Structure'");		
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ОчередьДействийСДокументами");
		
		Возврат Результат; 
		
	КонецЕсли;
	
	Если Не СтруктураЗаписи.Свойство("ТипОбъекта") Тогда 
		                                        
		ТекстОшибки = НСтр("ru = 'Отсутствует свойство ""ТипОбъекта""'; en = 'Object type property is missing'");
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ОчередьДействийСДокументами");
		
		Возврат Результат;		
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(СтруктураЗаписи.ТипОбъекта) Тогда 
		                                        
		ТекстОшибки = НСтр("ru = 'Не заполнен ""ТипОбъекта""'; en = 'Object type not filled in'");
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ОчередьДействийСДокументами");
		
		Возврат Результат;		
				
	КонецЕсли;
	
	Если Не СтруктураЗаписи.Свойство("ИдОбъекта") Тогда 
		                                        
		ТекстОшибки = НСтр("ru = 'Отсутствует свойство ""ИдОбъекта""'; en = 'Object ID property is missing'");
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ОчередьДействийСДокументами");
		
		Возврат Результат;		
		
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(СтруктураЗаписи.ИдОбъекта) Тогда 
		                                        
		ТекстОшибки = НСтр("ru = 'Не заполнен ""ИдОбъекта""'; en = 'Object ID not filled in'");
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ОчередьДействийСДокументами");
		
		Возврат Результат;		
				
	КонецЕсли;
	
	
	НаборЗаписей = РегистрыСведений.PAPI_ОчередьДействийСДокументами.СоздатьНаборЗаписей(); 
	НаборЗаписей.Отбор.ТипОбъекта.Установить(СтруктураЗаписи.ТипОбъекта);
	НаборЗаписей.Отбор.ИдОбъекта.Установить(СтруктураЗаписи.ИдОбъекта);
	
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		
		НоваяЗаписьРегистра = НаборЗаписей.Добавить();  	
		
	Иначе //НаборЗаписей.Количество() > 0
				
		НоваяЗаписьРегистра = НаборЗаписей[0]; 	
				
	КонецЕсли;

	МассивПолейРегистра = МассивПолейРегистра();;
	
	Попытка
		
		Для Каждого элМассива Из МассивПолейРегистра Цикл 
				
			Если СтруктураЗаписи.Свойство(элМассива) Тогда
				
				НоваяЗаписьРегистра[элМассива] = СтруктураЗаписи[элМассива];
					
			КонецЕсли	
			
		КонецЦикла;
		
		НаборЗаписей.ДополнительныеСвойства.Вставить("PAPIОтключитьПодпискуПередЗаписью");
		
		НаборЗаписей.Записать();
		Результат = Истина;
		
	Исключение

		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());		
		PAPI_Логирование.ЗаписатьВЛог("PAPI.Ошибка", Перечисления.PAPI_ТипЛога.Ошибка, ТекстОшибки, "РегистрыСведений.PAPI_ОчередьДействийСДокументами");						
					
	КонецПопытки;
		
	Если ВключенПривилегированныйРежим Тогда 
		ВключенПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;
	
	Возврат Результат; 	
	
КонецФункции

// Процедура - Выполнить действие с документом
//
// Параметры:
//  СтруктураЗаписи	 - Структура - см. ПолучитьСтруктуруПоУмолчанию 
//
Процедура ВыполнитьДействие(СтруктураЗаписи) Экспорт 
	
	ВключенПривилегированныйРежим = Ложь;
	Если Не ПривилегированныйРежим() Тогда  
		ВключенПривилегированныйРежим = Истина;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);
	КонецЕсли;
	
	СтруктураДанных = PAPI_ОбщегоНазначенияВызовСервера.СтруктураНавигационнойСсылки(СтруктураЗаписи.ИдОбъекта, "Ссылка");	
		
	Если СтруктураДанных.Отработал 
		И СтруктураДанных.Свойство("Результат") Тогда 
		
		ТипОбъекта = СтруктураДанных.Результат.ТипОбъекта;
	    ИдОбъекта  = СтруктураДанных.Результат.ИдОбъекта;   
		
	Иначе
		
		ТипОбъекта = СтруктураЗаписи.ТипОбъекта;
	    ИдОбъекта  = СтруктураЗаписи.ИдОбъекта; 
		
	КонецЕсли;	
					
	перВыполнено = Истина;		
	перКоличествоПопыток = СтруктураЗаписи.КоличествоПопыток;
		
	Попытка
			
		НайденнаяСсылка = XMLЗначение(Тип(ТипОбъекта), ИдОбъекта);
		перСсылкаСуществует = PAPI_ОбщегоНазначенияВызовСервера.СсылкаСуществует(НайденнаяСсылка);
			
		Если перСсылкаСуществует Тогда 
				
			ЭлОбъект = НайденнаяСсылка.ПолучитьОбъект();
			ЭлОбъект.ДополнительныеСвойства.Вставить("ОтключитьОбработкуПослеЗаписиВерсии");
			ЭлОбъект.ДополнительныеСвойства.Вставить("ОчередьДействийСДокументами");		
			
			Если СтруктураЗаписи.Действие = Перечисления.PAPI_ДействиеСДокументом.ОтменаПроведения Тогда
					
				ЭлОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения); 
					
			ИначеЕсли СтруктураЗаписи.Действие = Перечисления.PAPI_ДействиеСДокументом.ПроведениеНеоперативный Тогда
					
				ЭлОбъект.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
					
			ИначеЕсли СтруктураЗаписи.Действие = Перечисления.PAPI_ДействиеСДокументом.Проведение Тогда  
					
				ЭлОбъект.Записать(РежимЗаписиДокумента.Проведение);
					
			Иначе            
					
				ЭлОбъект.ОбменДанными.Загрузка = Истина;
				ЭлОбъект.Записать();
					
			КонецЕсли;		

			НайденнаяСсылка = ЭлОбъект.Ссылка;
	
			СтруктураЗаписи.Вставить("Представление", Строка(НайденнаяСсылка));
			СтруктураЗаписи.Вставить("ТекстОшибки", "");
			
		КонецЕсли;
					
	Исключение
			
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());  
		перВыполнено = Ложь;     
		СтруктураЗаписи.Вставить("ТекстОшибки", ТекстОшибки);
				
	КонецПопытки;
		
	СтруктураЗаписи.Вставить("Выполнено", перВыполнено);
	перКоличествоПопыток = перКоличествоПопыток + 1;
	СтруктураЗаписи.Вставить("КоличествоПопыток", перКоличествоПопыток);
		
	ДобавитьИзменитьЗапись(СтруктураЗаписи);
	
	Если ВключенПривилегированныйРежим Тогда 
		ВключенПривилегированныйРежим = Ложь;
		УстановитьПривилегированныйРежим(ВключенПривилегированныйРежим);	
	КонецЕсли;

КонецПроцедуры	

// Функция - Массив полей регистра
// 
// Возвращаемое значение:
//  Массив - Поля заполняемые при создании записи
//
Функция МассивПолейРегистра()
	
	МассивПолейРегистра = Новый Массив;  
	
	// Измерения
	МассивПолейРегистра.Добавить("ТипОбъекта");
	МассивПолейРегистра.Добавить("ИдОбъекта");
	
	// Стандартные свойства сообщения
	МассивПолейРегистра.Добавить("Действие");
	
	// Параметры с информацией по обмену
	МассивПолейРегистра.Добавить("Представление");
	
	// Отметка о выполнении
	МассивПолейРегистра.Добавить("Выполнено");
	
	// Ошибка записи
	МассивПолейРегистра.Добавить("ТекстОшибки");
	МассивПолейРегистра.Добавить("КоличествоПопыток");
	
	Возврат МассивПолейРегистра;
	
КонецФункции

// Функция - Структура для записи в регистр "PAPI_ОчередьДействийСДокументами"
//
// Возвращаемое значение:
//  СтруктураРегистра - Структура:
//		ТипОбъекта			- Строка - Тип документа
//		ИдОбъекта			- Строка - Уникальный идентификатор или навигационная ссылка
//		Действие			- Перечисления.PAPI_ДействиеСДокументом - Что нужно сделать с документом  
//		Представление		- Строка - Представление документа
//		Выполнено			- Булево - Признак выполнения
//		ТекстОшибки			- Строка - Описание произошедшей ошибки в ходе выполнения алгоритма 
//		КоличествоПопыток	- Число  - Количество неудачных попыток (ограничено в константе PAPI_КоличествоПопытокОчередиДокументов)
//
Функция ПолучитьСтруктуруПоУмолчанию() Экспорт
	
	СтруктураРегистра = Новый Структура;
	СтруктураРегистра.Вставить("ТипОбъекта", 		"");
	СтруктураРегистра.Вставить("ИдОбъекта", 		"");
	СтруктураРегистра.Вставить("Действие", 			Перечисления.PAPI_ДействиеСДокументом.ПустаяСсылка());
	СтруктураРегистра.Вставить("Представление",		"");
	СтруктураРегистра.Вставить("Выполнено",			Ложь);
	СтруктураРегистра.Вставить("ТекстОшибки",		"");
	СтруктураРегистра.Вставить("КоличествоПопыток", 0);
		
	Возврат СтруктураРегистра;    
	
КонецФункции
